Train on 25747 samples, validate on 6437 samples
Epoch 1/10
25747/25747 [==============================] - 358s 14ms/step - loss: 0.0552 - val_loss: 0.1203
Epoch 2/10
25747/25747 [==============================] - 357s 14ms/step - loss: 0.0483 - val_loss: 0.1438
Epoch 3/10
25747/25747 [==============================] - 358s 14ms/step - loss: 0.0444 - val_loss: 0.1282
Epoch 4/10
25747/25747 [==============================] - 357s 14ms/step - loss: 0.0417 - val_loss: 0.1226
Epoch 5/10
25747/25747 [==============================] - 357s 14ms/step - loss: 0.0396 - val_loss: 0.1204
Epoch 6/10
25747/25747 [==============================] - 358s 14ms/step - loss: 0.0380 - val_loss: 0.1338
Epoch 7/10
25747/25747 [==============================] - 357s 14ms/step - loss: 0.0371 - val_loss: 0.1602
Epoch 8/10
25747/25747 [==============================] - 358s 14ms/step - loss: 0.0359 - val_loss: 0.1343
Epoch 9/10
25747/25747 [==============================] - 358s 14ms/step - loss: 0.0345 - val_loss: 0.1680
Epoch 10/10
25747/25747 [==============================] - 357s 14ms/step - loss: 0.0334 - val_loss: 0.1422
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
lambda_1 (Lambda)            (None, 160, 320, 3)       0
_________________________________________________________________72000
cropping2d_1 (Cropping2D)    (None, 75, 320, 3)        0
_________________________________________________________________204768
conv2d_1 (Conv2D)            (None, 36, 158, 36)       2736
_________________________________________________________________59136
conv2d_2 (Conv2D)            (None, 16, 77, 48)        43248
_________________________________________________________________5256
conv2d_3 (Conv2D)            (None, 12, 73, 6)         7206
_________________________________________________________________1296
max_pooling2d_1 (MaxPooling2 (None, 6, 36, 6)          0
_________________________________________________________________384
conv2d_4 (Conv2D)            (None, 2, 32, 6)          906
_________________________________________________________________96
max_pooling2d_2 (MaxPooling2 (None, 1, 16, 6)          0
_________________________________________________________________
flatten_1 (Flatten)          (None, 96)                0
_________________________________________________________________
dense_1 (Dense)              (None, 128)               12416
_________________________________________________________________
dense_2 (Dense)              (None, 64)                8256
_________________________________________________________________
dense_3 (Dense)              (None, 32)                2080
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 33
=================================================================
Total params: 76,881
Trainable params: 76,881
Non-trainable params: 0
_________________________________________________________________
dict_keys(['loss', 'val_loss'])




Train on 25747 samples, validate on 6437 samples
Epoch 1/5
25747/25747 [==============================] - 356s 14ms/step - loss: 0.0530 - val_loss: 0.1187
Epoch 2/5
25747/25747 [==============================] - 355s 14ms/step - loss: 0.0466 - val_loss: 0.1286
Epoch 3/5
25747/25747 [==============================] - 356s 14ms/step - loss: 0.0418 - val_loss: 0.1239
Epoch 4/5
25747/25747 [==============================] - 356s 14ms/step - loss: 0.0398 - val_loss: 0.1426
Epoch 5/5
25747/25747 [==============================] - 356s 14ms/step - loss: 0.0373 - val_loss: 0.1369
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
cropping2d_1 (Cropping2D)    (None, 75, 320, 3)        0
_________________________________________________________________
lambda_1 (Lambda)            (None, 75, 320, 3)        0
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 36, 158, 36)       2736
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 16, 77, 48)        43248
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 12, 73, 6)         7206
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 6, 36, 6)          0
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 2, 32, 6)          906
_________________________________________________________________
flatten_1 (Flatten)          (None, 384)               0
_________________________________________________________________
dense_1 (Dense)              (None, 128)               49280
_________________________________________________________________
dense_2 (Dense)              (None, 64)                8256
_________________________________________________________________
dense_3 (Dense)              (None, 32)                2080
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 33
=================================================================
Total params: 113,745
Trainable params: 113,745
Non-trainable params: 0


_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
cropping2d_1 (Cropping2D)    (None, 75, 320, 3)        0         
_________________________________________________________________
lambda_1 (Lambda)            (None, 75, 320, 3)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 38, 160, 24)       1824      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 17, 78, 36)        21636     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 7, 37, 48)         43248     
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 5, 35, 64)         27712     
_________________________________________________________________
flatten_1 (Flatten)          (None, 11200)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               1433728   
_________________________________________________________________
dense_2 (Dense)              (None, 64)                8256      
_________________________________________________________________
dense_3 (Dense)              (None, 32)                2080      
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 33        
=================================================================
Total params: 1,538,517
Trainable params: 1,538,517
Non-trainable params: 0
_________________________________________________________________

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lambda_1 (Lambda)            (None, 160, 320, 3)       0         
_________________________________________________________________
cropping2d_1 (Cropping2D)    (None, 65, 320, 3)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 31, 158, 24)       1824      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 14, 77, 36)        21636     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 5, 37, 48)         43248     
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 3, 35, 64)         27712     
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 1, 33, 64)         36928     
_________________________________________________________________
flatten_1 (Flatten)          (None, 2112)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 100)               211300    
_________________________________________________________________
dense_2 (Dense)              (None, 50)                5050      
_________________________________________________________________
dense_3 (Dense)              (None, 10)                510       
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 11        
_________________________________________________________________
activation_1 (Activation)    (None, 1)                 0         
=================================================================
Total params: 348,219
Trainable params: 348,219
Non-trainable params: 0
_________________________________________________________________
